# 05: Membalik urutan baris dan kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  7  6  9  1
1  3  3  3  8  5
2  3  3  6  8  4
3  9  4  1  2  6
4  2  5  3  6  7

# Membalik urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  1  9  6  7  8
1  5  8  3  3  3
2  4  8  6  3  3
3  6  2  1  4  9
4  7  6  3  5  2

# Membalik urutan baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  2  5  3  6  7
3  9  4  1  2  6
2  3  3  6  8  4
1  3  3  3  8  5
0  8  7  6  9  1

# Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  2  5  3  6  7
1  9  4  1  2  6
2  3  3  6  8  4
3  3  3  3  8  5
4  8  7  6  9  1